Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: We call this technique *sharding*, where each machine is called a *shard*.
it_it: Chiamiamo questa tecnica *sharding*, dove ogni macchina è chiamata *shard*.

source: We encourage you to use gMock as
it_it: Invitiamo a utilizzare gMock come

source: We have decided to fix this (thanks to Michael Chastain for the idea).
it_it: Abbiamo deciso di risolvere questo problema (grazie a Michael Chastain per l'idea).

source: We may make it nice by default in the future.
it_it: Potremmo renderlo nice per default in futuro.

source: We omit such using statements in this section for brevity, but you should do it in your own code.
it_it: In questa sezione, per brevità, omettiamo le istruzioni using, ma nel codice lo si dovrebbe fare.

source: We omit such `using` statements in this section for brevity, but you should do it in your own code.
it_it: In questa sezione, per brevità, omettiamo le istruzioni `using`, ma nel codice lo si dovrebbe fare.

source: We recommend you to use this feature judiciously.
it_it: Consigliamo di utilizzare questa funzione con giudizio.

source: We suggest to avoid /clr when compiling native C++ mocks.
it_it: Suggeriamo di evitare /clr durante la compilazione di mock C++ nativi.

source: We suggest to avoid `/clr` when compiling native C++ mocks.
it_it: Suggeriamo di evitare `/clr` durante la compilazione di mock C++ nativi.

source: We suggest to avoid them in new code; they hide a lot of logic behind the macro, potentially leading to harder-to-understand compiler errors.
it_it: Suggeriamo di evitarle nel nuovo codice; si nasconde molta logica dietro la macro, portando potenzialmente a errori del compilatore difficili da comprendere.

source: We use the term "sequence" to mean a directed path in this DAG.
it_it: Usiamo il termine "sequenza" per indicare un percorso diretto in questo DAG.

source: We would like to fix this, but it requires cleaning up existing tests.
it_it: Vorremmo risolvere questo problema, ma è necessario ripulire i test esistenti.

source: We would only recommend to do it as an intermediate step when you are refactoring your code.
it_it: Consigliamo di farlo solo come passaggio intermedio nell'effettuare il refactoring del codice.

source: We'll consider a more permanent solution after the fork-and-exec-style death tests are implemented.
it_it: Prenderemo in considerazione una soluzione più permanente dopo l'implementazione dei death test in stile fork-and-exec.

source: We'll discuss how each clause works in the coming sections.
it_it: Illustreremo come funziona ciascuna clausola nelle prossime sezioni.

source: We'll now explain how to write a test program, starting at the individual assertion level and building up to tests and test suites.
it_it: Spiegheremo ora come scrivere un "test program", partendo dal livello della singola asserzione e costruendo poi "test" e "test suite".

source: We've noticed that when the /clr compiler flag is used, Visual C++ uses 5~6 times as much memory when compiling a mock class.
it_it: Abbiamo notato che quando viene utilizzato il flag del compilatore /clr , Visual C++ usa 5~6 volte più memoria durante la compilazione di una classe mock.

source: We've noticed that when the `/clr` compiler flag is used, Visual C++ uses 5~6 times as much memory when compiling a mock class.
it_it: Abbiamo notato che quando viene utilizzato il flag del compilatore `/clr`, Visual C++ usa 5~6 volte più memoria durante la compilazione di una classe mock.

source: We've seen AtLeast(n) as an example of fuzzy cardinalities earlier.
it_it: Abbiamo visto AtLeast(n) come esempio di cardinalità fuzzy in precedenza.

source: We've seen `AtLeast(n)` as an example of fuzzy cardinalities earlier.
it_it: Abbiamo visto `AtLeast(n)` come esempio di cardinalità fuzzy in precedenza.

source: Welcome to GoogleTest!
it_it: Benvenuti in GoogleTest!

source: Welcome to GoogleTest's documentation!
it_it: Benvenuti nella Documentazione di GoogleTest!

source: Well it serves two purposes: first it makes expectations easily identifiable (either by grep or by a human reader), and second it allows gMock to include the source file location of a failed expectation in messages, making debugging easier.
it_it: Beh, ha due scopi: in primo luogo rende le expectation facilmente identificabili (sia da grep che da un lettore umano), e in secondo luogo consente a gMock di includere la posizione del file sorgente di una expectation non riuscita nei messaggi, facilitando il debugging.

source: Well it serves two purposes: first it makes expectations easily identifiable (either by `grep` or by a human reader), and second it allows gMock to include the source file location of a failed expectation in messages, making debugging easier.
it_it: Beh, ha due scopi: in primo luogo rende le expectation facilmente identificabili (sia da `grep` che da un lettore umano), e in secondo luogo consente a gMock di includere la posizione del file sorgente di una expectation non riuscita nei messaggi, facilitando il debugging.

source: Well, after all WillOnce()s are used up, gMock will do the default action for the function every time (unless, of course, you have a WillRepeatedly().).
it_it: Bene, dopo che tutti i WillOnce() sono esauriti, gMock eseguirà ogni volta l'azione di default per la funzione (a meno che, ovviamente, non si abbia un WillRepeatedly ()).

source: Well, after all `WillOnce()`s are used up, gMock will do the *default* action for the function every time (unless, of course, you have a `WillRepeatedly()`.).
it_it: Bene, dopo che tutti i `WillOnce()` sono esauriti, gMock eseguirà ogni volta l'azione di *default* per la funzione (a meno che, ovviamente, non si abbia un `WillRepeatedly()`).

source: Well, gMock has an action to solve *exactly* this problem:
it_it: Beh, gMock ha un'azione per risolvere *esattamente* questo problema:

source: Well, gMock has an action to solve exactly this problem:
it_it: Beh, gMock ha un'azione per risolvere esattamente questo problema:

source: Well, in this case, the code was already broken in the first place, so we didn't break it.
it_it: Bene, in questo caso il codice era già bacato, quindi non è stato guastato adesso.

source: Well, it might be created on the heap and owned by the code you are testing.
it_it: Ebbene, potrebbe essere creato nell'heap e posseduto [own] dal codice che si sta testando

source: Well, specifying the expectation beforehand allows gMock to report a violation as soon as it rises, when the context (stack trace, etc) is still available.
it_it: Ebbene, specificare in anticipo la expectation consente a gMock di riportare una violazione non appena si verifica, quando il contesto (stack trace, ecc.) è ancora disponibile.

source: Well, you can run it and compare the screen with a golden screen snapshot, but let's admit it: tests like this are expensive to run and fragile (What if you just upgraded to a shiny new graphics card that has better anti-aliasing?
it_it: Bene, lo si può eseguire e confrontare lo schermo con una schermata campione, ma ammettiamolo: test come questo sono costosi da eseguire e fragili (e se si passasse a una nuova brillante scheda grafica con un anti-aliasing migliore?

source: Well, you can use the Pointee(m) matcher.
it_it: Ebbene, si può usare il matcher Pointee(m).

source: Well, you can use the `Pointee(m)` matcher.
it_it: Ebbene, si può usare il matcher `Pointee(m)`.

source: What will they do?).
it_it: Cosa faranno?).

source: What Is gMock?
it_it: Cos'è gMock?

source: What can I do?
it_it: Cosa posso fare?

source: What can be wrong?
it_it: Cosa può esserci di sbagliato?

source: What can the statement argument in ASSERT_DEATH() be?
it_it: Quale può essere l'argomento dell'istruzione in ASSERT_DEATH()?

source: What can we do inside WillOnce() besides Return()?
it_it: Cosa possiamo fare all'interno di WillOnce() oltre a Return()?

source: What can we do inside `WillOnce()` besides `Return()`?
it_it: Cosa possiamo fare all'interno di `WillOnce()` oltre a `Return()`?

source: What do I do?
it_it: Cosa si deve fare?

source: What do you think the following means?
it_it: Cosa significa quanto segue?

source: What do you think will happen if a Return action is performed more than once (e.g. you write ... .WillRepeatedly(Return(std::move(...)));)?
it_it: Cosa accadrà se un'azione Return viene eseguita più di una volta (ad esempio scrivendo ... .WillRepeatedly(Return(std::move(...)));)?

source: What do you think will happen if a `Return` action is performed more than once (e.g. you write `... .WillRepeatedly(Return(std::move(...)));`)?
it_it: Cosa accadrà se un'azione `Return` viene eseguita più di una volta (ad esempio scrivendo `... .WillRepeatedly(Return(std::move(...)));`)?

source: What does it mean?
it_it: Cosa significa?

source: What framework would you use to test it?
it_it: Quale framework si userebbe per testarla?

source: What gives?
it_it: Cosa dà?

source: What happens if TestSuiteName or TestName contains _?
it_it: Cosa succede se TestSuiteName o TestName contengono _?

source: What happens if `TestSuiteName` or `TestName` contains `_`?
it_it: Cosa succede se `TestSuiteName` o `TestName` contengono `_`?

source: What if the callable takes an argument by reference and we do **not** wrap the argument in `std::ref()`?
it_it: Cosa succede se il callable accetta un argomento per riferimento e **non** racchiudiamo l'argomento in `std::ref()`?

source: What if the callable takes an argument by reference and we do not wrap the argument in std::ref()?
it_it: Cosa succede se il callable accetta un argomento per riferimento e non racchiudiamo l'argomento in std::ref()?

source: What if the callable takes an argument by reference?
it_it: Cosa succede se il "callable" accetta un argomento per riferimento?

source: What if the number you specified is larger than there are WillOnce() clauses?
it_it: Cosa succede se il numero specificato è maggiore delle clausole WillOnce()?

source: What if the number you specified is larger than there are `WillOnce()` clauses?
it_it: Cosa succede se il numero specificato è maggiore delle clausole `WillOnce()`?

source: What if you actually meant to disallow this function to be called, but forgot to write EXPECT_CALL(foo, Bar()).Times(0)?
it_it: Cosa succederebbe se in realtà si intendesse impedire la chiamata di questa funzione, ma ci si dimenticasse di scrivere EXPECT_CALL(foo, Bar()).Times(0)?

source: What if you actually meant to disallow this function to be called, but forgot to write `EXPECT_CALL(foo, Bar()).Times(0)`?
it_it: Cosa succederebbe se in realtà si intendesse impedire la chiamata di questa funzione, ma ci si dimenticasse di scrivere `EXPECT_CALL(foo, Bar()).Times(0)`?

source: What if you have a pointer to pointer?
it_it: Cosa succede se si ha un puntatore a puntatore?

source: What if you want to validate more than one members at the same time?
it_it: Cosa succede se si validano più di un membro contemporaneamente?

source: What it means is that you have a mock function, you haven't set any expectations on it (by gMock's rule this means that you are not interested in calls to this function and therefore it can be called any number of times), and it is called.
it_it: Ciò che si intende è che si ha una funzione mock, non è stata impostata alcuna expectation su di essa (secondo la regola di gMock ciò significa che non si è interessati alle chiamate a questa funzione e quindi può essere chiamata un numero qualsiasi di volte), e viene chiamata.

source: What matters is that it must have a Perform() method template.
it_it: Ciò che conta è che deve avere un metodo template Perform().

source: What matters is that it must have a `Perform()` method template.
it_it: Ciò che conta è che deve avere un metodo template `Perform()`.

source: What should I do?
it_it: Cosa dovrei fare?

source: What should it do?
it_it: Cosa dovrebbe fare?

source: What's going on?
it_it: Cosa sta succedendo?

source: What's more, mock methods with different signatures have different types and thus their constructors/destructors need to be generated by the compiler separately.
it_it: Inoltre, i metodi mock con firme diverse hanno tipi diversi e quindi i loro costruttori/distruttori devono essere generati separatamente dal compilatore.

source: What's the problem?
it_it: Qual è il problema?

source: What's wrong?
it_it: Cosa c'è che non va?

source: When ScopedMockLog intercepts these messages and finds that they don't match any expectations, it prints an error for each of them.
it_it: Quando ScopedMockLog intercetta questi messaggi e rileva che non corrispondono ad alcuna aspettativa, stampa un errore per ciascuno di essi.

source: When U is a reference, T must also be a reference (as the underlying matcher may be interested in the address of the U value).
it_it: Quando U è un riferimento, anche T dev'essere un riferimento (poiché il matcher in questione potrebbe essere interessato all'indirizzo del valore U).

source: When argument is sorted using the < operator, it matches container matcher m.
it_it: Quando argument viene ordinato utilizzando l'operatore <, corrisponde al matcher contenitore m.

source: When Foo() is called later, gMock compares the argument to Foo() with the saved copy of bar.
it_it: Quando Foo() viene chiamato in seguito, gMock confronta l'argomento di Foo() con la copia salvata di bar.

source: When GoogleTest sees the above two environment variables, it will select a subset of the test functions to run.
it_it: Quando GoogleTest vede le due variabili di ambiente precedenti, selezionerà un sottoinsieme delle funzioni di test da eseguire.

source: When I call a method on my mock object, the method for the real object is invoked instead.
it_it: Quando chiamo un metodo sul mio oggetto mock, viene invece richiamato il metodo per l'oggetto reale.

source: When `Foo()` is called later, gMock compares the argument to `Foo()` with the saved copy of `bar`.
it_it: Quando `Foo()` viene chiamato in seguito, gMock confronta l'argomento di `Foo()` con la copia salvata di `bar`.

source: When `ScopedMockLog` intercepts these messages and finds that they don't match any expectations, it prints an error for each of them.
it_it: Quando `ScopedMockLog` intercetta questi messaggi e rileva che non corrispondono ad alcuna aspettativa, stampa un errore per ciascuno di essi.

source: When `U` is a reference, `T` must also be a reference (as the underlying matcher may be interested in the address of the `U` value).
it_it: Quando `U` è un riferimento, anche `T` dev'essere un riferimento (poiché il matcher in questione potrebbe essere interessato all'indirizzo del valore `U`).

source: When `argument` is sorted using the `<` operator, it matches container matcher `m`.
it_it: Quando `argument` viene ordinato utilizzando l'operatore `<`, corrisponde al matcher contenitore `m`.

source: When a mock function takes arguments, we may specify what arguments we are expecting, for example:
it_it: Quando una funzione mock accetta argomenti, possiamo specificare quali ci aspettiamo, ad esempio:

source: When a mock is destructed, gMock will automatically check whether all expectations on it have been satisfied.
it_it: Quando un mock viene distrutto, gMock controllerà automaticamente se tutte le expectation su di esso sono state soddisfatte.

source: When a mock method is called, gMock only considers expectations that are still active.
it_it: Quando viene chiamato un metodo mock, gMock considera solo le expectation ancora attive.

source: When a mock method is called, the *last* matching expectation that's still active will be selected (think "newer overrides older").
it_it: Quando viene chiamato un metodo mock, verrà selezionato l'*ultimo* matching expectation ancora attiva (si pensi che "il più recente sovrascrive il più vecchio").

source: When a mock method is called, the last matching expectation that's still active will be selected (think "newer overrides older").
it_it: Quando viene chiamato un metodo mock, verrà selezionato l'ultimo matching expectation ancora attiva (si pensi che "il più recente sovrascrive il più vecchio").

source: When a mock object is destructed, gMock automatically verifies that all expectations on it have been satisfied.
it_it: Quando un oggetto mock viene distrutto, gMock verifica automaticamente che tutte le expectation su di esso siano state soddisfatte.

source: When a test assertion such as EXPECT_EQ fails, GoogleTest prints the argument values to help you debug.
it_it: Quando un'asserzione di test come EXPECT_EQ fallisce, GoogleTest stampa i valori degli argomenti per eseguire il debug.

source: When a test assertion such as `EXPECT_EQ` fails, GoogleTest prints the argument values to help you debug.
it_it: Quando un'asserzione di test come `EXPECT_EQ` fallisce, GoogleTest stampa i valori degli argomenti per eseguire il debug.

source: When a test crashes, the failure signal handler will try to log a lot of information (the stack trace, and the address map, for example).
it_it: Quando un test va in crash, l'handler del segnale di errore tenterà di loggare molte informazioni (il trace dello stack e la mappa degli indirizzi, ad esempio).

source: When a test fails, GoogleTest allows you to run it in isolation for quick debugging.
it_it: Quando un test fallisce, GoogleTest consente di eseguirlo in isolamento per un debug rapido.

source: When a typed test fails, the default output includes the name of the type, which can help you quickly identify which implementation is wrong.
it_it: Quando un test tipizzato fallisce, l'output di default include il nome del tipo, che può aiutare a identificare rapidamente quale implementazione sia sbagliata.

source: When an On*Start() or OnTestPartResult() event is fired, the listeners will receive it in the order they appear in the list (since new listeners are added to the end of the list, the default text printer and the default XML generator will receive the event first).
it_it: Quando viene attivato un evento On*Start() o un OnTestPartResult(), i listener lo riceveranno nell'ordine in cui appaiono nell'elenco (poiché i nuovi listener vengono aggiunti alla finedelle lista, la stampante del testo e il generatore XML di default riceveranno per primi l'evento).

source: When an `On*Start()` or `OnTestPartResult()` event is fired, the listeners will receive it in the order they appear in the list (since new listeners are added to the end of the list, the default text printer and the default XML generator will receive the event first).
it_it: Quando viene attivato un evento `On*Start()` o `OnTestPartResult()`, i listener lo riceveranno nell'ordine in cui appaiono nell'elenco (poiché i nuovi listener vengono aggiunti alla finedelle lista, la stampante del testo e il generatore XML di default riceveranno per primi l'evento).

source: When an assertion fails, GoogleTest prints the assertion's source file and line number location, along with a failure message.
it_it: Quando un'asserzione fallisce, GoogleTest stampa il file sorgente dell'asserzione e la posizione del numero di riga, insieme a un messaggio di errore.

source: When an event is fired, its context is passed to the handler function as an argument.
it_it: Quando viene generato un evento, il suo contesto viene passato alla funzione del gestore [handler] come argomento.

source: When an uninteresting or unexpected call occurs, gMock prints the argument values and the stack trace to help you debug.
it_it: Quando avviene una chiamata [uninteresting] o inaspettata [unexpected], gMock stampa i valori degli argomenti e lo stack trace come aiuto al debug.

source: When both T and U are built-in arithmetic types (bool, integers, and floating-point numbers), the conversion from T to U is not lossy (in other words, any value representable by T can also be represented by U); and
it_it: Quando sia T che U sono tipi aritmetici nativi (bool, integer e numeri in virgola mobile), la conversione da T a U è senza perdita di informazioni (in altre parole, qualsiasi valore rappresentabile da T può essere rappresentato da U); e

source: When both `T` and `U` are built-in arithmetic types (`bool`, integers, and floating-point numbers), the conversion from `T` to `U` is not lossy (in other words, any value representable by `T` can also be represented by `U`); and
it_it: Quando sia `T` che `U` sono tipi aritmetici nativi (`bool`, integer e numeri in virgola mobile), la conversione da `T` a `U` è senza perdita di informazioni (in altre parole, qualsiasi valore rappresentabile da `T` può essere rappresentato da `U`); e

source: When built with Bazel and using Abseil, GoogleTest uses the RE2 syntax.
it_it: Quando si builda con Bazel e utilizzando Abseil, GoogleTest usa la sintassi RE2.

source: When built with Bazel and using Abseil, GoogleTest uses the [RE2](https://github.com/google/re2/wiki/Syntax) syntax.
it_it: Quando si builda con Bazel e utilizzando Abseil, GoogleTest usa la sintassi [RE2](https://github.com/google/re2/wiki/Syntax).

source: When calling sub-routines inside a loop, make the loop iterator part of the message in SCOPED_TRACE such that you can know which iteration the failure is from.
it_it: Quando si chiamano subroutine all'interno di un ciclo, rendere l'iteratore del ciclo parte del messaggio in SCOPED_TRACE in modo tale da poter sapere da quale iterazione proviene l'errore.

source: When calling sub-routines inside a loop, make the loop iterator part of the message in `SCOPED_TRACE` such that you can know which iteration the failure is from.
it_it: Quando si chiamano subroutine all'interno di un ciclo, rendere l'iteratore del ciclo parte del messaggio in `SCOPED_TRACE` in modo tale da poter sapere da quale iterazione proviene l'errore.

source: When choosing between being neat and being safe, we lean toward the latter.
it_it: Quando scegliamo tra l’essere puliti e l’essere al sicuro, tendiamo verso quest’ultimo.

source: When comparing a pointer to NULL, use EXPECT_EQ(ptr, nullptr) instead of EXPECT_EQ(ptr, NULL).
it_it: Quando si confronta un puntatore con NULL, si usa EXPECT_EQ(ptr, nullptr) anziché EXPECT_EQ(ptr, NULL).

source: When comparing a pointer to NULL, use EXPECT_NE(ptr, nullptr) instead of EXPECT_NE(ptr, NULL).
it_it: Confrontando un puntatore con NULL, si usa EXPECT_NE(ptr, nullptr) anziché EXPECT_NE(ptr, NULL).

source: When comparing a pointer to `NULL`, use `EXPECT_EQ(`*`ptr`*`, nullptr)` instead of `EXPECT_EQ(`*`ptr`*`, NULL)`.
it_it: Quando si confronta un puntatore con `NULL`, si usa `EXPECT_EQ(`*`ptr`*`, nullptr)` anziché `EXPECT_EQ(`*`ptr`*`, NULL)`.

source: When comparing a pointer to `NULL`, use `EXPECT_NE(`*`ptr`*`, nullptr)` instead of `EXPECT_NE(`*`ptr`*`, NULL)`.
it_it: Confrontando un puntatore con `NULL`, si usa `EXPECT_NE(`*`ptr`*`, nullptr)` anziché `EXPECT_NE(`*`ptr`*`, NULL)`.

source: When debugging the test failures, however, you may instead want the exceptions to be handled by the debugger, such that you can examine the call stack when an exception is thrown.
it_it: Durante il debug degli errori di test, tuttavia, si potrebbe invece volere che le eccezioni vengano gestite dal debugger, in modo da poter esaminare lo stack delle chiamate quando viene generata un'eccezione.

source: When defining a callable to be used with Invoke*(), you can declare any unused parameters as Unused:
it_it: Quando si definisce un callable da utilizzare con Invoke*(), si può dichiarare qualsiasi parametro inutilizzato come Unused:

source: When defining a callable to be used with `Invoke*()`, you can declare any unused parameters as `Unused`:
it_it: Quando si definisce un callable da utilizzare con `Invoke*()`, si può dichiarare qualsiasi parametro inutilizzato come `Unused`:
